etc/OpenFOAM_sample_files/indoor_airflow_2d/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1612+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/* Butterfly 0.0.3       https://github.com/ladybug-analysis-tools/butterfly *\
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		4.0;
	format		ascii;
	class		dictionary;
	location	"system";
	object		blockMeshDict;
}

convertToMeters 1.0000;

vertices
(
	(0.80000000000000004 2.66769535297891 -0.20000000000000001)
	(9.199999999999999 2.66769535297891 -0.20000000000000001)
	(9.199999999999999 3.2676953529789117 -0.20000000000000001)
	(0.80000000000000004 3.2676953529789117 -0.20000000000000001)
	(0.80000000000000004 2.66769535297891 6.2)
	(9.199999999999999 2.66769535297891 6.2)
	(9.199999999999999 3.2676953529789117 6.2)
	(0.80000000000000004 3.2676953529789117 6.2)
);

blocks
(
hex (0 1 2 3 4 5 6 7) (42 1 32) 
simpleGrading (
	1.0
	1.0
	1.0
	)
);

edges
(
);

boundary
(   boundingbox
   {
       type wall;
       faces
       (       
	(0 3 2 1)
	(4 5 6 7)
	(1 2 6 5)
	(3 0 4 7)
       );
   }

   boundingbox_empty
   {
       type empty;
       faces
       (       
	(0 1 5 4)
	(2 3 7 6)
       );
   }
);

mergePatchPair
(
);
