etc/OpenFOAM_sample_files/indoor_airflow_2d/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1612+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/* Butterfly 0.0.3       https://github.com/ladybug-analysis-tools/butterfly *\
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		4.0;
	format		ascii;
	class		volScalarField;
	location	"0";
	object		p;
}

dimensions		[0 2 -2 0 0 0 0];

internalField		uniform 0;

boundaryField
{

    boundingbox_empty
    {

        type		empty;

    }

    west_window
    {

        type		zeroGradient;

    }

    room
    {

        type		zeroGradient;

    }

    east_window
    {

        type		fixedValue;

        value		uniform 0;

    }

}