etc/OpenFOAM_sample_files/indoor_airflow_2d/system/probes

functions
{

    probes
    {

        functionObjectLibs		("libsampling.so");

        type		probes;

        name		probes;

        fields		(p U);

...

        writeControl		timeStep;

        writeInterval		1;

    }

}